Catalogs/ШаблоныЭтикетокИЦенниковБПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныЭтикетокИЦенниковБПО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLОписаниеМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныЭтикетокИЦенниковБПО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - имя объекта, для которого вызывается заполнение.
//  Настройки - Структура:
//    * ПриНачальномЗаполненииЭлемента - Булево - если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//    * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(ПолноеИмяОбъекта, Настройки) Экспорт
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
КонецПроцедуры

// Процедура заполняет предопределенные элементы в справочнике Шаблоны этикеток и ценников.
//
Процедура ПриНачальномЗаполненииЭлементов(ЭтоОбновление = Ложь) Экспорт //+ОЛИМП для обновления из макета
	
	ОписанияМакетов = ОписанияМакетов();
	
	НачатьТранзакцию();
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ШаблоныЭтикетокИЦенниковБПО.Ссылка КАК Ссылка,
			|	ШаблоныЭтикетокИЦенниковБПО.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
			|ИЗ
			|	Справочник.ШаблоныЭтикетокИЦенниковБПО КАК ШаблоныЭтикетокИЦенниковБПО
			|ГДЕ
			//+ОЛИМП
			//Было:
			//|	ШаблоныЭтикетокИЦенниковБПО.Предопределенный
			//|	И (ВЫРАЗИТЬ(ШаблоныЭтикетокИЦенниковБПО.XMLОписаниеМакета КАК СТРОКА(1))) = """""; 
			|	ШаблоныЭтикетокИЦенниковБПО.Предопределенный";
			
			Если Не ЭтоОбновление Тогда
				Запрос.Текст = Запрос.Текст + Символы.ПС + "И (ВЫРАЗИТЬ(ШаблоныЭтикетокИЦенниковБПО.XMLОписаниеМакета КАК СТРОКА(1))) = """"";
			КонецЕсли;
			//-ОЛИМП
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ШаблоныЭтикетокИЦенниковБПО");
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ШаблоныЭтикетокИЦенниковБПО
			ШаблонОбъект.XMLОписаниеМакета = ОписанияМакетов[Выборка.ИмяПредопределенныхДанных];
			//+ОЛИМП
			ОпределитьПоляШаблона(ОписанияМакетов[Выборка.ИмяПредопределенныхДанных], ШаблонОбъект);
			//-ОЛИМП
			ШаблонОбъект.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ОбщегоНазначенияБПО.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Заполнение предопределенных элементов'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ОписанияМакетов()
	
	ОписанияМакетов = Новый Соответствие();
	Макет = Справочники.ШаблоныЭтикетокИЦенниковБПО.ПолучитьМакет("ШаблоныЭтикеток");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		XMLОписаниеМакета = Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
		
		Если Не ПустаяСтрока(ИмяПредопределенного) = "" Тогда
			ОписанияМакетов.Вставить(ИмяПредопределенного, XMLОписаниеМакета);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписанияМакетов;
	
КонецФункции

Процедура ОпределитьПоляШаблона(Источник, Объект)
	
	СообщениеОбОшибке = "";
	СодержимоеXMLФайла = Неопределено;
	
	Если ОборудованиеПринтерыЭтикеток.ПолучитьОписаниеМакета(Источник, СообщениеОбОшибке, СодержимоеXMLФайла) Тогда
		
		Объект.Поля.Очистить();
		
		Для Каждого ТекПоле Из СодержимоеXMLФайла.Поля Цикл
			НовоеПоле = Объект.Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПоле, ТекПоле);
		КонецЦикла;
		
	Иначе
		//ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
